pmunts/arm-mcu/gcc/stm32f4/serial.c
// Initialize ring buffers

      if (InitializeRingBuffers(port))
        return -1;

// Turn on USART1 peripheral clock

      RCC->APB2ENR |= RCC_APB2ENR_USART1EN;

#ifdef STM32_M4_CLICKER
// Configure TX pin on PB6

      RCC->AHB1ENR |= RCC_AHB1ENR_GPIOBEN;

      GPIOB->AFR[0] &= ~(0xF << 24);
      GPIOB->AFR[0] |= 7 << 24;
      GPIOB->MODER &= ~GPIO_MODER_MODER6;
      GPIOB->MODER |= GPIO_MODER_MODER6_1;
      GPIOB->OTYPER &= ~GPIO_OTYPER_OT_6;
      GPIOB->OSPEEDR &= ~GPIO_OSPEEDER_OSPEEDR6;
      GPIOB->OSPEEDR |= GPIO_OSPEEDER_OSPEEDR6_1;
      GPIOB->PUPDR &= ~GPIO_PUPDR_PUPDR6;

// Configure RX pin PB7

      RCC->AHB1ENR |= RCC_AHB1ENR_GPIOBEN;

      GPIOB->AFR[0] &= ~(0xF << 28);
      GPIOB->AFR[0] |= 7 << 28;
      GPIOB->MODER &= ~GPIO_MODER_MODER7;
      GPIOB->MODER |= GPIO_MODER_MODER7_1;
      GPIOB->PUPDR &= ~GPIO_PUPDR_PUPDR7;
      GPIOB->PUPDR |= GPIO_PUPDR_PUPDR7_0;
#else
// Configure TX pin on PA9

      RCC->AHB1ENR |= RCC_AHB1ENR_GPIOAEN;

      GPIOA->AFR[1] &= ~(0xF << 4);
      GPIOA->AFR[1] |= 7 << 4;
      GPIOA->MODER &= ~GPIO_MODER_MODER9;
      GPIOA->MODER |= GPIO_MODER_MODER9_1;
      GPIOA->OTYPER &= ~GPIO_OTYPER_OT_9;
      GPIOA->OSPEEDR &= ~GPIO_OSPEEDER_OSPEEDR9;
      GPIOA->OSPEEDR |= GPIO_OSPEEDER_OSPEEDR9_1;
      GPIOA->PUPDR &= ~GPIO_PUPDR_PUPDR9;

// Configure RX pin PA10

      RCC->AHB1ENR |= RCC_AHB1ENR_GPIOAEN;

      GPIOA->AFR[1] &= ~(0xF << 8);
      GPIOA->AFR[1] |= 7 << 8;
      GPIOA->MODER &= ~GPIO_MODER_MODER10;
      GPIOA->MODER |= GPIO_MODER_MODER10_1;
      GPIOA->PUPDR &= ~GPIO_PUPDR_PUPDR10;
      GPIOA->PUPDR |= GPIO_PUPDR_PUPDR10_0;
#endif

// Configure USART1

      USART1->CR1 = USART_CR1_OVER8|USART_CR1_UE|USART_CR1_RXNEIE|USART_CR1_TE|USART_CR1_RE;
      USART1->CR2 = 0x0000;
      USART1->CR3 = 0x0000;
      USART1->BRR = CalcBRR(port, baudrate);
      USART1->GTPR = 0x0000;

// Enable USART1 interrupts

      NVIC->IP[USART1_IRQn] = 0x88;
      NVIC->ISER[USART1_IRQn / 32] = 1 << USART1_IRQn % 32;
      break;
#endif

#ifdef USART2
    case 1 : // USART2

// Initialize ring buffers

      if (InitializeRingBuffers(port))
        return -1;

// Turn on USART2 peripheral clock

      RCC->APB1ENR |= RCC_APB1ENR_USART2EN;

// Configure TX pin on PA2

      RCC->AHB1ENR |= RCC_AHB1ENR_GPIOAEN;

      GPIOA->AFR[0] &= ~(0xF << 8);
      GPIOA->AFR[0] |= 7 << 8;
      GPIOA->MODER &= ~GPIO_MODER_MODER2;
      GPIOA->MODER |= GPIO_MODER_MODER2_1;
      GPIOA->OTYPER &= ~GPIO_OTYPER_OT_2;
      GPIOA->OSPEEDR &= ~GPIO_OSPEEDER_OSPEEDR2;
      GPIOA->OSPEEDR |= GPIO_OSPEEDER_OSPEEDR2_1;
      GPIOA->PUPDR &= ~GPIO_PUPDR_PUPDR2;

// Configure RX pin on PA3

      RCC->AHB1ENR |= RCC_AHB1ENR_GPIOAEN;

      GPIOA->AFR[0] &= ~(0xF << 12);
      GPIOA->AFR[0] |= 7 << 12;
      GPIOA->MODER &= ~GPIO_MODER_MODER3;
      GPIOA->MODER |= GPIO_MODER_MODER3_1;
      GPIOA->PUPDR &= ~GPIO_PUPDR_PUPDR3;
      GPIOA->PUPDR |= GPIO_PUPDR_PUPDR3_0;

// Configure USART2

      USART2->CR1 = USART_CR1_OVER8|USART_CR1_UE|USART_CR1_RXNEIE|USART_CR1_TE|USART_CR1_RE;
      USART2->CR2 = 0x0000;
      USART2->CR3 = 0x0000;
      USART2->BRR = CalcBRR(port, baudrate);
      USART2->GTPR = 0x0000;

// Enable USART2 interrupts

      NVIC->IP[USART2_IRQn] = 0x88;
      NVIC->ISER[USART2_IRQn / 32] = 1 << USART2_IRQn % 32;
      break;
#endif

#ifdef USART3
    case 2 : // USART3

// Initialize ring buffers

      if (InitializeRingBuffers(port))
        return -1;

// Turn on USART3 peripheral clock

      RCC->APB1ENR |= RCC_APB1ENR_USART3EN;

#ifdef STM32_M4_CLICKER
// Configure TX pin on PC10

      RCC->AHB1ENR |= RCC_AHB1ENR_GPIOCEN;

      GPIOC->AFR[1] &= ~(0xF << 8);
      GPIOC->AFR[1] |= 7 << 8;
      GPIOC->MODER &= ~GPIO_MODER_MODER10;
      GPIOC->MODER |= GPIO_MODER_MODER10_1;
      GPIOC->OTYPER &= ~GPIO_OTYPER_OT_10;
      GPIOC->OSPEEDR &= ~GPIO_OSPEEDER_OSPEEDR10;
      GPIOC->OSPEEDR |= GPIO_OSPEEDER_OSPEEDR10_1;
      GPIOC->PUPDR &= ~GPIO_PUPDR_PUPDR10;

// Configure RX pin on PC11

      RCC->AHB1ENR |= RCC_AHB1ENR_GPIOCEN;

      GPIOC->AFR[1] &= ~(0xF << 12);
      GPIOC->AFR[1] |= 7 << 12;
      GPIOC->MODER &= ~GPIO_MODER_MODER11;
      GPIOC->MODER |= GPIO_MODER_MODER11_1;
      GPIOC->PUPDR &= ~GPIO_PUPDR_PUPDR11;
      GPIOC->PUPDR |= GPIO_PUPDR_PUPDR11_0;
#else
// Configure TX pin on PB10

      RCC->AHB1ENR |= RCC_AHB1ENR_GPIOBEN;

      GPIOB->AFR[1] &= ~(0xF << 8);
      GPIOB->AFR[1] |= 7 << 8;
      GPIOB->MODER &= ~GPIO_MODER_MODER10;
      GPIOB->MODER |= GPIO_MODER_MODER10_1;
      GPIOB->OTYPER &= ~GPIO_OTYPER_OT_10;
      GPIOB->OSPEEDR &= ~GPIO_OSPEEDER_OSPEEDR10;
      GPIOB->OSPEEDR |= GPIO_OSPEEDER_OSPEEDR10_1;
      GPIOB->PUPDR &= ~GPIO_PUPDR_PUPDR10;

// Configure RX pin on PB11

      RCC->AHB1ENR |= RCC_AHB1ENR_GPIOBEN;

      GPIOB->AFR[1] &= ~(0xF << 12);
      GPIOB->AFR[1] |= 7 << 12;
      GPIOB->MODER &= ~GPIO_MODER_MODER11;
      GPIOB->MODER |= GPIO_MODER_MODER11_1;
      GPIOB->PUPDR &= ~GPIO_PUPDR_PUPDR11;
      GPIOB->PUPDR |= GPIO_PUPDR_PUPDR11_0;
#endif

// Configure USART3

      USART3->CR1 = USART_CR1_OVER8|USART_CR1_UE|USART_CR1_RXNEIE|USART_CR1_TE|USART_CR1_RE;
      USART3->CR2 = 0x0000;
      USART3->CR3 = 0x0000;
      USART3->BRR = CalcBRR(port, baudrate);
      USART3->GTPR = 0x0000;

// Enable USART3 interrupts

      NVIC->IP[USART3_IRQn] = 0x88;
      NVIC->ISER[USART3_IRQn / 32] = 1 << USART3_IRQn % 32;
      break;
#endif

#ifdef UART4
    case 3 : // UART4

// Initialize ring buffers

      if (InitializeRingBuffers(port))
        return -1;

// Turn on UART4 peripheral clock

      RCC->APB1ENR |= RCC_APB1ENR_UART4EN;

// Configure TX pin on PA0

      RCC->AHB1ENR |= RCC_AHB1ENR_GPIOAEN;

      GPIOA->AFR[0] &= ~(0xF << 0);
      GPIOA->AFR[0] |= 8 << 0;
      GPIOA->MODER &= ~GPIO_MODER_MODER0;
      GPIOA->MODER |= GPIO_MODER_MODER0_1;
      GPIOA->OTYPER &= ~GPIO_OTYPER_OT_0;
      GPIOA->OSPEEDR &= ~GPIO_OSPEEDER_OSPEEDR0;
      GPIOA->OSPEEDR |= GPIO_OSPEEDER_OSPEEDR0_1;
      GPIOA->PUPDR &= ~GPIO_PUPDR_PUPDR0;

// Configure RX pin on PA1

      RCC->AHB1ENR |= RCC_AHB1ENR_GPIOAEN;

      GPIOA->AFR[0] &= ~(0xF << 4);
      GPIOA->AFR[0] |= 8 << 4;
      GPIOA->MODER &= ~GPIO_MODER_MODER1;
      GPIOA->MODER |= GPIO_MODER_MODER1_1;
      GPIOA->PUPDR &= ~GPIO_PUPDR_PUPDR1;
      GPIOA->PUPDR |= GPIO_PUPDR_PUPDR1_0;

// Configure UART4

      UART4->CR1 = USART_CR1_OVER8|USART_CR1_UE|USART_CR1_RXNEIE|USART_CR1_TE|USART_CR1_RE;
      UART4->CR2 = 0x0000;
      UART4->CR3 = 0x0000;
      UART4->BRR = CalcBRR(port, baudrate);
      UART4->GTPR = 0x0000;

