pmunts/arm-mcu/gcc/stm32f4/serial.c
// Enable UART4 interrupts

      NVIC->IP[UART4_IRQn] = 0x88;
      NVIC->ISER[UART4_IRQn / 32] = 1 << UART4_IRQn % 32;
      break;
#endif

#ifdef UART5
    case 4 : // UART5

// Initialize ring buffers

      if (InitializeRingBuffers(port))
        return -1;

// Turn on UART5 peripheral clock

      RCC->APB1ENR |= RCC_APB1ENR_UART5EN;

// Configure TX pin on PC12

      RCC->AHB1ENR|= RCC_AHB1ENR_GPIOCEN;

      GPIOA->AFR[1] &= ~(0xF << 16);
      GPIOA->AFR[1] |= 8 << 16;
      GPIOC->MODER &= ~GPIO_MODER_MODER12;
      GPIOC->MODER |= GPIO_MODER_MODER12_1;
      GPIOC->OTYPER &= ~GPIO_OTYPER_OT_12;
      GPIOC->OSPEEDR &= ~GPIO_OSPEEDER_OSPEEDR12;
      GPIOC->OSPEEDR |= GPIO_OSPEEDER_OSPEEDR12_1;
      GPIOC->PUPDR &= ~GPIO_PUPDR_PUPDR12;

// Configure RX pin on PD2

      RCC->AHB1ENR|= RCC_AHB1ENR_GPIODEN;

      GPIOA->AFR[0] &= ~(0xF << 8);
      GPIOA->AFR[0] |= 8 << 8;
      GPIOD->MODER &= ~GPIO_MODER_MODER2;
      GPIOD->MODER |= GPIO_MODER_MODER2_1;
      GPIOD->PUPDR &= ~GPIO_PUPDR_PUPDR2;
      GPIOD->PUPDR |= GPIO_PUPDR_PUPDR2_0;

// Configure UART5

      UART5->CR1 = USART_CR1_OVER8|USART_CR1_UE|USART_CR1_RXNEIE|USART_CR1_TE|USART_CR1_RE;
      UART5->CR2 = 0x0000;
      UART5->CR3 = 0x0000;
      UART5->BRR = CalcBRR(port, baudrate);
      UART5->GTPR = 0x0000;

// Enable UART5 interrupts

      NVIC->IP[UART5_IRQn] = 0x88;
      NVIC->ISER[UART5_IRQn / 32] = 1 << UART5_IRQn % 32;
      break;
#endif

#ifdef USART6
    case 5 : //  USART6

// Initialize ring buffers

      if (InitializeRingBuffers(port))
        return -1;

// Turn on USART6 peripheral clock

      RCC->APB2ENR |= RCC_APB2ENR_USART6EN;

#ifdef NUCLEO_F411RE
// Configure TX pin on PA11 (aka Arduino D1, wire wrap CN10 pin 35 to CN10 pin 14)

      RCC->AHB1ENR |= RCC_AHB1ENR_GPIOAEN;

      GPIOA->AFR[1] &= ~(0xF << 12);
      GPIOA->AFR[1] |= 8 << 12;
      GPIOA->MODER &= ~GPIO_MODER_MODER11;
      GPIOA->MODER |= GPIO_MODER_MODER11_1;
      GPIOA->OTYPER &= ~GPIO_OTYPER_OT_11;
      GPIOA->OSPEEDR &= ~GPIO_OSPEEDER_OSPEEDR11;
      GPIOA->OSPEEDR |= GPIO_OSPEEDER_OSPEEDR11_1;
      GPIOA->PUPDR &= ~GPIO_PUPDR_PUPDR11;

// Configure RX pin on PA12 (aka Arduino D0, wire wrap CN10 pin 37 to CN10 pin 12)

      RCC->AHB1ENR |= RCC_AHB1ENR_GPIOAEN;

      GPIOA->AFR[1] &= ~(0xF << 16);
      GPIOA->AFR[1] |= 8 << 16;
      GPIOA->MODER &= ~GPIO_MODER_MODER12;
      GPIOA->MODER |= GPIO_MODER_MODER12_1;
      GPIOA->PUPDR &= ~GPIO_PUPDR_PUPDR12;
      GPIOA->PUPDR |= GPIO_PUPDR_PUPDR12_0;
#else
// Configure TX pin on PC6

      RCC->AHB1ENR |= RCC_AHB1ENR_GPIOCEN;

      GPIOA->AFR[0] &= ~(0xF << 24);
      GPIOA->AFR[0] |= 8 << 24;
      GPIOC->MODER &= ~GPIO_MODER_MODER6;
      GPIOC->MODER |= GPIO_MODER_MODER6_1;
      GPIOC->OTYPER &= ~GPIO_OTYPER_OT_6;
      GPIOC->OSPEEDR &= ~GPIO_OSPEEDER_OSPEEDR6;
      GPIOC->OSPEEDR |= GPIO_OSPEEDER_OSPEEDR6_1;
      GPIOC->PUPDR &= ~GPIO_PUPDR_PUPDR6;

// Configure RX pin on PC7

      RCC->AHB1ENR |= RCC_AHB1ENR_GPIOCEN;

      GPIOA->AFR[0] &= ~(0xF << 28);
      GPIOA->AFR[0] |= 8 << 28;
      GPIOC->MODER &= ~GPIO_MODER_MODER7;
      GPIOC->MODER |= GPIO_MODER_MODER7_1;
      GPIOC->PUPDR &= ~GPIO_PUPDR_PUPDR7;
      GPIOC->PUPDR |= GPIO_PUPDR_PUPDR7_0;
#endif

// Configure USART6

      USART6->CR1 = USART_CR1_OVER8|USART_CR1_UE|USART_CR1_RXNEIE|USART_CR1_TE|USART_CR1_RE;
      USART6->CR2 = 0x0000;
      USART6->CR3 = 0x0000;
      USART6->BRR = CalcBRR(port, baudrate);
      USART6->GTPR = 0x0000;

// Enable USART6 interrupts

      NVIC->IP[USART6_IRQn] = 0x88;
      NVIC->ISER[USART6_IRQn / 32] = 1 << USART6_IRQn % 32;
      break;
#endif

    default :
      errno_r = ENODEV;
      return -1;
  }

  return 0;
}

/* Register serial port for standard I/O */

int serial_stdio(char *name)
{
  unsigned subdevice;

  if (serial_open(name, &subdevice))
    return -1;

  // Nuke existing stdin, stdout, stderr

  device_unregister(0);
  device_unregister(1);
  device_unregister(2);

  // Register new stdin, stdout, stderr

  device_register_char_fd(0, subdevice, NULL, serial_read, NULL, serial_rxready, NULL);
  device_register_char_fd(1, subdevice, serial_write, NULL, serial_txready, NULL, NULL);
  device_register_char_fd(2, subdevice, serial_write, NULL, serial_txready, NULL, NULL);

  return 0;
}

/* Register a serial port device */

int serial_register(char *name)
{
  unsigned port;

// Look up serial port number

  port = serial_name_to_port(name);
  if (port < 0) return port;

// Register the serial port driver

  return device_register_char(name, port, serial_open, NULL, serial_write, serial_read, serial_txready, serial_rxready, NULL);
}

/* Return true if receive data is available */

int serial_rxready(unsigned port)
{
  volatile ringbuffer_t *bufptr;

  errno_r = 0;

  if (port >= MAX_SERIAL_PORTS)
  {
    errno_r = ENODEV;
    return -1;
  }

  bufptr = UARTS[port].rxbuffer;

  if (bufptr == NULL)
  {
    errno_r = ENODEV;
    return -1;
  }

  return (bufptr->count > 0);
}

/* Read data from the serial port */

int serial_read(unsigned port, char *buf, unsigned count)
{
  volatile ringbuffer_t *bufptr;
  int len = 0;

  errno_r = 0;

  if (port >= MAX_SERIAL_PORTS)
  {
    errno_r = ENODEV;
    return -1;
  }

  if (buf == NULL)
  {
    errno_r = EINVAL;
    return -1;
  }

  bufptr = UARTS[port].rxbuffer;

  if (bufptr == NULL)
  {
    errno_r = ENODEV;
    return -1;
  }

  while ((bufptr->count > 0) && (count > 0))
  {
    *buf++ = bufptr->data[bufptr->tail];
    count--;
    __disable_irq();
    bufptr->count--;
    __enable_irq();
    bufptr->tail++;
    bufptr->tail &= BUFSIZE-1;
    len++;
  }

  return len;
}

/* Return true if transmitter is ready to accept data */

int serial_txready(unsigned port)
{
  volatile ringbuffer_t *bufptr;

  errno_r = 0;

  if (port >= MAX_SERIAL_PORTS)
  {
    errno_r = ENODEV;
    return -1;
  }

  bufptr = UARTS[port].txbuffer;

  if (bufptr == NULL)
  {
    errno_r = ENODEV;
    return -1;
  }

  return (bufptr->count < BUFSIZE);
}

/* Send data out the serial port */

int serial_write(unsigned port, char *buf, unsigned count)
{
  volatile ringbuffer_t *bufptr;
  int len = 0;

  errno_r = 0;

  if (port >= MAX_SERIAL_PORTS)
  {
    errno_r = ENODEV;
    return -1;
  }

  if (buf == NULL)
  {
    errno_r = EINVAL;
    return -1;
  }

  bufptr = UARTS[port].txbuffer;

